hugo/public/lunescript/regret/index.html
<!DOCTYPE html>
<html lang="ja-jp">
<head><meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
<title>A. LuneScript の言語仕様でミスだったと思っているところ - 公開技術情報</title>
<meta name="generator" content="Hugo 0.100.1" />
<link href="https://ifritjp.github.io/documentsindex.xml" rel="alternate" type="application/rss+xml">
<link rel="canonical" href="https://ifritjp.github.io/documents/lunescript/regret/">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/theme.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/chroma.min.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/custom.css">
<link rel="stylesheet" href="https://ifritjp.github.io/documents/css/highlight_lns.css">
<meta property="og:title" content="A. LuneScript の言語仕様でミスだったと思っているところ" />
<meta property="og:description" content="LuneScript は、自分の中で初の本格的なプログラミング言語開発の経験でした。 自分なりにさまざまな言語を調べ、 できるだけ使い勝手の良い言語になるよう設計を" />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://ifritjp.github.io/documents/lunescript/regret/" /><meta property="article:section" content="LuneScript" />

<meta property="og:site_name" content="公開技術情報" />

<meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="A. LuneScript の言語仕様でミスだったと思っているところ"/>
<meta name="twitter:description" content="LuneScript は、自分の中で初の本格的なプログラミング言語開発の経験でした。 自分なりにさまざまな言語を調べ、 できるだけ使い勝手の良い言語になるよう設計を"/>
<meta itemprop="name" content="A. LuneScript の言語仕様でミスだったと思っているところ">
<meta itemprop="description" content="LuneScript は、自分の中で初の本格的なプログラミング言語開発の経験でした。 自分なりにさまざまな言語を調べ、 できるだけ使い勝手の良い言語になるよう設計を">

<meta itemprop="wordCount" content="1822">
<meta itemprop="keywords" content="" />
</head>
<body><div class="container"><header>
<h1>公開技術情報</h1>


[<a href="https://ifritjp.github.io/documents/en/">English</a>]

[<a href="https://ifritjp.github.io/documents/">Japanese</a>]

</header>
<div class="global-menu">
<nav>
<ul>
<li><a href="/documents/">Home</a></li>
<li><a href="https://ifritjp.github.io/blog2/public/">blog</a></li>
<li><a href="https://ifritjp.github.io/LuneScript-webFront/contents/">LuneScript on Web</a></li></ul>
</nav>
</div>
<div class="content-container">
<main><h1>A. LuneScript の言語仕様でミスだったと思っているところ</h1>

<p>
LuneScript は、自分の中で初の本格的なプログラミング言語開発の経験でした。</p>
<p>
自分なりにさまざまな言語を調べ、
できるだけ使い勝手の良い言語になるよう設計をしてきましたが、
それでも「ここは良くなかった」と思う点は幾つかあります。</p>
<p>
ここではそれらの点を挙げて、どうするべきだったかをまとめます。</p>
<p>
LuneScript はトランスコンパイラなので、一般的なプログラミング言語としての話だけでなく、
トランスコンパイラ特有の話も挙げます。</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
基本的な記号(<code class="verbatim">?</code>)を、あまり重要でない機能に使ってしまった
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
LuneScript は、ある文字の文字コードを取得する際に、 <code class="verbatim">?</code> を使います。</p>
<p>
例えば <code class="verbatim">a</code> の文字コード 0x61 を取得するには、以下のように書きます。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">// @lnsFront: ok
let code = ?a; // (0x61)</code></pre>
</div>
<p>
簡単に文字コードを取得できる、という意味では良いのですが、
「文字コードを取得する」という制御が必要になるケースは、
一般的なプログラミングにはほとんどありません。</p>
<p>
そのほとんど使用しないケースに <code class="verbatim">?</code> を使ってしまったため、
別の言語機能に記号を紐付けたいときに <code class="verbatim">?</code> が使えなくなってしまいました。</p>
<p>
ASCII コードで利用可能な記号において、</p>
<ul>
<li>パッと見の認識しやすい文字</li>
<li>キーボードからタイプしやすい文字</li>
<li>他のプログラミング言語の基本的な制御で利用されていない文字</li>
</ul>
<p>上記の条件を全て満す記号は次しかありません。 (人によって多少増減すると思います)</p>
<pre class="example">
# $ ? \ &amp; @ !
</pre>
<p>
この貴重な記号を、ほとんど使わない機能に割り当ててしまったのは大きな失敗でした。</p>
<p>
特に「 <code class="verbatim">?</code> の直後の文字のコードを取得する」という仕様では、
<code>==</code> や <code>&gt;=</code> などの記号の組み合わせの中に <code class="verbatim">?</code> を含めて使用することも出来ません。</p>
<p>
Parse に影響するような仕様(immediate な文字列表現、数値表現、etc…) をプログラミング言語に取り込む際は、
十分に注意が必要でした。</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
トランスコンパイル先の Lua に影響を受け過ぎた
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>
当初の LuneScript は、Lua 専用のトランスコンパイラでした。</p>
<p>
当然 LuneScript の想定ユーザは、 Lua プログラマです。</p>
<p>
よって、LuneScript は Lua のプログラマが扱い易いように言語仕様を定義しています。</p>
<p>
これには次のメリットがあります。</p>
<ul>
<li>LuneScript の学習コストが低い</li>
<li>LuneScript で書いたコードを Lua へ変換する際に、
多くの場合そのままの形で変換でき、変換後のコードを追い易い</li>
</ul>
<p>しかし、次のものに関しては、Lua とは異なる仕様にするべきでした。</p>
<ul>
<li>List などのインデックスが 0 からではなく 1 から始まる</li>
<li><code class="verbatim">~=</code> や <code class="verbatim">..</code> などの独特な演算子</li>
<li>and or の演算結果</li>
<li>多値返却の動作</li>
</ul>
<p>
この中で、最初の 2 個のインデックスと、 <code class="verbatim">~=</code> や <code class="verbatim">..</code> などの独特の演算子に関しては、
他の一般的なプログラム言語との仕様が違うので使い分けしないとならない、
という使い勝手の問題です。</p>
<p>
一方で、残りは Lua 以外へのトランスコンパイル処理を考えた時に処理が複雑になってしまう、
という問題です。
処理が複雑になることで、変換後のコードを追い難くなるのと、
変換後のコードの実行時にオーバーヘッドが掛る、ということにつながります。</p>
<p>
トランスコンパイラとはいえ一つの独立したプログラム言語であるので、
変換先の言語を意識し過ぎずに、自分が理想とする言語仕様を検討するべきでした。</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
immutable のデフォルト
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>
変数やメンバなどの型を宣言する際、 
<code class="verbatim">&amp;</code> を型名の前に付けると immutable を示します。
そして、 <code class="verbatim">&amp;</code> を付けずに型名だけの場合は mutable です。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">let val:&amp;List&lt;int&gt; = [ 1, 2 ];  // immutable list
let val:List&lt;int&gt; = [ 1, 2 ];   // mutable list</code></pre>
</div>
<p>
一方で、変数宣言で型推論を使った初期化を行なうと、
<code class="verbatim">mut</code> を変数名の前に付けるとその変数と型が mutable になります。
そして、 <code class="verbatim">mut</code> を付けないと変数と型が immutable になります。</p>
<div class="src src-lns">
<pre tabindex="0"><code class="language-lns" data-lang="lns">let mut val = [ 1, 2 ];  // mutable list
let val = [ 1, 2 ];   // immutable list</code></pre>
</div>
<p>
修飾子の有無によって型の mutable が変わるのですが、
mut と &amp; とで mutable の動作が逆になってしまっています。</p>
<p>
これは、非常に紛らわしいです。</p>
<p>
何故こうなってしまったかというと、
当初は Rust のような所有権制御を実現したかったんですが、
所有権制御を実現する前にトランスコンパイラとして動かすことを優先したため、
型の制御を中途半端なまま実装をしてしまい、
その動作が今も残っている、という状況です。</p>
<p>
mutable 制御は、現状の仕様のまま残すしかないですが、
所有権制御は何らかの形で実現したいと思っています。</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
イマドキではない仕様
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>
LuneScript にはイマドキではない仕様がいくつかありますが、
それらは敢えてそうしています。</p>
<ul>
<li>文の区切りに <code class="verbatim">;</code> が必要</li>
<li>シンボルのアクセス制限</li>
</ul>
<p>
比較的新しい言語では <code class="verbatim">;</code> がない方が主流なような気がしますが、
<code class="verbatim">;</code> があった方が確実に文が終っていることが、
ぱっと見で、分かり易いと考えているので、あえて必須にしています。</p>
</div>
</div>
<div class="edit-meta">

<br></div><nav class="pagination"><a class="nav nav-prev-2" href="https://ifritjp.github.io/documents/lunescript/reason/" title="A. Lua のトランスコンパイラ LuneScript を開発した理由"><i class="fas fa-arrow-left" aria-hidden="true"></i> Prev - A. Lua のトランスコンパイラ LuneScript を開発した理由</a>
<a class="nav nav-next-2" href="https://ifritjp.github.io/documents/lunescript/onweb/" title="A. Web ブラウザ上で動作する LuneScript">Next - A. Web ブラウザ上で動作する LuneScript <i class="fas fa-arrow-right" aria-hidden="true"></i></a>
</nav><footer><p class="powered">Powered by <a href="https://gohugo.io">Hugo</a>. Theme by <a href="https://themes.gohugo.io/hugo-theme-techdoc/">TechDoc</a>. Designed by <a href="https://github.com/thingsym/hugo-theme-techdoc">Thingsym</a>.</p>
</footer>
</main><div class="sidebar">

<nav class="slide-menu">
<ul>
<li class=""><a href="https://ifritjp.github.io/documents">Home</a></li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/lctags/">C/C&#43;&#43; ソースコードタグシステム lctags の紹介<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lctags/introduce/">C/C&#43;&#43; ソースコードタグシステム lctags の紹介</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/rename/">C/C&#43;&#43; ソースコードをリファクタリング by lctags on emacs (リネーム編)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/enum/">C/C&#43;&#43; の enum 補完 by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/highlight/">C/C&#43;&#43; の特定シンボルをハイライト by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/varsize/">C/C&#43;&#43; の変数サイズ確認 by lctags on emacs</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/callgraph/">C言語/C&#43;&#43; コードを解析してインタラクティブなコールグラフ表示 by lctags</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/modulegraph/">C言語/C&#43;&#43; コードを解析してインタラクティブなモジュール構成図っぽいグラフ表示 by lctags</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/callfunc/">lctags で C 言語の関数コールを簡単に</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/register/">lctags のプロジェクト簡易登録</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/c-language/">lctags を開発している時に改めて感じた C 言語規格のイケてないところ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/subroutine/">lctags を使って C/C&#43;&#43; ソースコードをリファクタリング(サブルーチン化編)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lctags/windows/">Windows で lctags (C言語/C&#43;&#43; のタグジャンプ、コールグラフ、etc..)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/lua/">C/C&#43;&#43; 言語プログラマのための Lua 入門リファレンス<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lua/detail/">C インタフェース詳細編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/interface/">C インタフェース編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/fengari/">fengari の使い方 (Lua を Web ブラウザで動かす方法)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/lua5.4/">Lua 5.4 の主な変更点</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/anti-pattern/">Lua でやりがちなミス</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lua/pointer/">ポインタ編</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/emacs/">Emacs<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/emacs/simple-httpd/">emacs 簡易 HTTPD 化パケージ simple-httpd.el</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/emacs/company-mode/">自作言語 (LuneScript) の emacs company-mode backend 設定</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/go/">Goes<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/go/package/">Go のパッケージ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/go/guide/">Go 入門</a></li>
</ul>
  
</li>

<li class=""><a href="https://ifritjp.github.io/documents/gcp/">Google Cloud Platform を使ってみる</a>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/javascript/">Javascripts<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/javascript/d3force/">D3.js V4 forceSimulation のノード動的更新(追加・削除)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/libclang/">Lua で C/C&#43;&#43; の構文解析 (libclang の Lua binding)<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/libclang/operator/">libclang で演算子を特定する方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/libclang/ast/">libclang の AST(Abstract Syntax Tree)</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/rust/">Rusts<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/rust/lifetime/">C/C&#43;&#43;エンジニアのための Rust のデータ所有権とライフタイム入門</a></li>
</ul>
  
</li>

<li class=" has-sub-menu"><a href="https://ifritjp.github.io/documents/singleboard/">Singleboards<span class="mark closed">+</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/raspios64-point/">64bit 版 Raspberry Pi OS でカーネルモジュールを使った際に遭遇したエラーと対応方法</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/build-kernel-module-64/">64bit 版 Raspberry Pi OS のカーネルモジュールのビルド環境設定</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/bluetooth-a2dp-receiver/">Raspberry Pi で Bluetooth レシーバー (オーディオ:A2DP) を作成するための設定方法解説</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/usb-gadget/">USB Gadget 機能を利用して Raspberry Pi を HID Keyboard と RNDIS の複合デバイスにする</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/singleboard/recover-image/">誤ってパーティションテーブル (LBA 0) を消して(0クリアして)しまった場合の対処</a></li>
</ul>
  
</li>

<li class="parent has-sub-menu"><a href="https://ifritjp.github.io/documents/lunescript/">トランスコンパイラ LuneScript で Lua の開発をもっと楽に!!<span class="mark opened">-</span></a>
  
<ul class="sub-menu">
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial1/">00. はじめに</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial2.setup/">01. 導入編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/tutorial3.hello/">02. Hello world</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/crosscompile/">03. Lua バージョン間のクロスコンパイル</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/value/">04. 値編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/set/">04.2. Set 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/enum/">05. enum 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/match/">06. match 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/variable/">07. 変数 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/branch/">08. 一般分岐構文 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/loop/">09. 繰り返し構文 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/func/">10. 関数 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/multipleretval/">10.2. 多値の戻り値</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/defaultarg/">10.3. 引数の省略 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/arg/">10.4. 可変長引数、戻り値 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/closure/">10.5. クロージャ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/nilable/">11. nilable 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/class1/">12. クラス 基本 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/class2accessor/">13. accessor 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classinherit/">14. クラス 継承 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classadvertise/">15. クラス advertise 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classoverride/">16. クラス override 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/interface/">17. インタフェース 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/classmapping/">18. mapping 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/generics/">19. generics 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/nilcond/">20. nil 条件演算子 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/import/">21. import/provide 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/require/">22. require/module 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/glue/">22.1. glue コードの半自動生成</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lua/">22.2. Lua と連携 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/make/">23. ビルド 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/macro/">24. マクロ 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/cast/">25. キャスト 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/subfile/">26. subfile 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lazyloading/">27. 遅延ロード 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/shebang_main/">28. shebang とコマンドライン引数</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/dir/">29. LuneScript を利用するプロジェクトの推奨ディレクトリ構成</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go/">80. Go 言語へのトランスコンパイル</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_package/">80.2 Go 言語へのトランスコンパイル時のパッケージ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lua_runtime/">80.3 Go へトランスコンパイルした際の Lua ランタイム</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_wasm/">80.4 LuneScript の WebAssembly 対応</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/async/">81. 安全な非同期処理</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/async_old/">81.1 非同期処理(過去情報)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/luago/">82. Lua と連携 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/lnstags/">A. lnstags によるタグジャンプ (ソースコードタグシステム)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/reason/">A. Lua のトランスコンパイラ LuneScript を開発した理由</a></li>
<li class="active"><a href="https://ifritjp.github.io/documents/lunescript/regret/">A. LuneScript の言語仕様でミスだったと思っているところ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/onweb/">A. Web ブラウザ上で動作する LuneScript</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/recommend/">A. トランスコンパイラ開発のすゝめ</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/completion/">A.イマドキな開発環境でもっと楽しよう</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/box/">Box 編</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/test/">X. 言語開発の品質コントロールにおけるセルフホスティングの重要性とテスト設計</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/go_study/">Z. Go 言語へのトランスコンパイル (検討段階)</a></li>
<li class=""><a href="https://ifritjp.github.io/documents/lunescript/all/">全文検索用結合ファイル</a></li>
</ul>
  
</li>
</ul>
</nav>



<div class="sidebar-footer"></div>
</div>
</div><a href="#" id="backtothetop-fixed" class="backtothetop"
 data-backtothetop-duration="600"
 data-backtothetop-easing="easeOutQuart"
 data-backtothetop-fixed-fadeIn="1000"
 data-backtothetop-fixed-fadeOut="1000"
 data-backtothetop-fixed-bottom="10"
 data-backtothetop-fixed-right="20">
<span class="fa-layers fa-fw">
<i class="fas fa-circle"></i>
<i class="fas fa-arrow-circle-up"></i>
</span></a>
</div>
</body>
</html>
